ws-clients/sopui-test

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.it2go.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:sayHi>
         <!--Optional:-->
         <text>Request2</text>
      </ser:sayHi>
   </soapenv:Body>
</soapenv:Envelope>

im request dann
user: mkyong
password: 123456
WSS-Password Type: Password Text


Soap pur

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.it2go.com/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="TestSecurityPolicy">
            <wsse:Username>mkyong</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">123456</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ser:sayHi>
         <!--Optional:-->
         <text>All Peaple</text>
      </ser:sayHi>
   </soapenv:Body>
</soapenv:Envelope>


Änderung in Branch1!